Tekla Open API Reference for Tekla Structures 2025
ProfileConversion.ConvertToCurrentUnits Method
 Converts a profile string from internal units to current units (set in Units and decimals options).
 Namespace: Tekla.Structures.Dialog
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool ConvertToCurrentUnits(
	string Profile,
	ref string ConvertedProfile
)
Public Shared Function ConvertToCurrentUnits (
	Profile As String,
	ByRef ConvertedProfile As String
) As Boolean
Parameters
Profile
Type: System.String
The profile string to convert.
ConvertedProfile
Type: System.String
The converted profile string.
Return Value
Type: Boolean
True if successfully converted the string.
See Also
Reference
ProfileConversion Class
Tekla.Structures.Dialog Namespace